package day16;

/*
	È¸¿øÀÇ Á¤º¸¸¦ ÀúÀåÇÒ Å¬·¡½º¸¦ ¸¸µå¼¼¿ä.
		È¸¿øÀÌ¸§, ¾ÆÀÌµğ, ÀÌ¸ŞÀÏ, ºñ¹Ğ¹øÈ£, ÁÖ¼Ò, ÀüÈ­¹øÈ£, »ıÀÏ
	À» ÀúÀåÇÒ VO Å¬·¡½º¸¦ ¸¸µå¼¼¿ä.
	
	È¸¿øÁ¤º¸¸¦ ÀÔ·Â¹Ş¾Æ¼­
	Á¤±Ô½Ä °Ë»ç¸¦ ÇÏ°í
	°Ë»ç°¡ Åë°úÇÑ °æ¿ì¿¡¸¸ ÀÔ·ÂÀÌ µÇ°Ô 
	ÇÁ·Î±×·¥À» ÀÛ¼ºÇÏ¼¼¿ä...
	
	Âü°í]
		ÇÑ±Û : [°¡-ÆR]
 */

import java.util.*;
public class Ex01 {
/*
	StringTokenizer
		==> ÇÏ³ªÀÇ ¹®ÀÚ¿­À» ¹®ÀÚ¿­ ³»¿¡ Æ÷ÇÔµÇ¾îÀÖ´Â 
			Æ¯Á¤ ¹®ÀÚ¸¦ ±âÁØÀ¸·Î ÀÚ¸£´Â ±â´É°¡Áø Å¬·¡½º
			
			<== ³×Æ®¿öÅ© µîÀ» ÀÌ¿ëÇÏ¸é
				¿©·¯°³ÀÇ µ¥ÀÌÅÍ°¡ ÇÑ¹ø¿¡ µé¾î¿Ã ¼ö ÀÖ´Ù.
				
				ÇÑ¹ø¿¡ µé¾î¿À´Â µ¥ÀÌÅÍ´Â ¹®ÀÚ¿­·Î ³Ñ¾î¿Â´Ù.
				ÀÌ¶§ ¿øÇÏ´Â Á¤º¸¸¸ Àß¶ó¼­ º¼ ÇÊ¿ä°¡ »ı±ä´Ù.
				
				¿¹]
					Ã¤ÆÃÇÁ·Î±×·¥ÀÇ °æ¿ì
					¸Ş¼¼Áö¸¦ ÀÔ·ÂÇÏ¸é ¸Ş½ÃÁö, ±Û¾´ÀÌ, ½Ã°£,...
					==> ÀÌ·±°æ¿ì °¢ ³»¿ëÀ» ºĞ¸®ÇØ¼­ Ã³¸®¸¦ ÇØÁà¾ß ÇÏ´Âµ¥...
						º¸³½»ç¶÷@º¸³½½Ã°£@³»¿ë
						
		»ı¼º¹æ¹ı
			1. StringTokenizer(String str)
			==> ¹®ÀÚ¿­À» °ø¹éÀ» Áß½ÉÀ¸·Î ³ª´©´Â ±â´É
			
			2. StringTokenizer(String str, String delim)
			==> str ¹®ÀÚ¿­À» delim À» ±âÁØÀ¸·Î ³ª´²ÁÖ´Â ±â´É
			
			3. StringTokenizer(String str, String delim, boolean returnDelims)
			==> 2¹øÀÇ ±â´É¿¡ ºĞ¸®¹®ÀÚµµ ÇÏ³ªÀÇ ¹®ÀÚ·Î Ã³¸®ÇÑ´Ù.
			
			
		==> ºĞ¸®µÈ °á°ú´Â ¹öÆÛ(½ºÅØ)¿¡ ±â¾ïÀÌ µÈ´Ù.
			ÀÌ°ÍÀº ÇÑ¹ø ²¨³»¼­ ¾²¸é ´õÀÌ»ó »ç¿ëÇÒ ¼ö ¾ø°ÔµÈ´Ù.
			µû¶ó¼­ ¹İµå½Ã ¼ø¼­´ë·Î ²¨³»¾ß ÇÑ´Ù.
			
		ÁÖ¿äÇÔ¼ö]
			countTokens()
			==> ³ª´²Áø °á°ú ¼ö
			
			hasMoreElements()/hasMoreTokens()
			==> ¾ÆÁ÷ ¹öÆÛ¿¡ ²¨³»¿Ã µ¥ÀÌÅÍ°¡ ³²¾Æ ÀÖ´ÂÁö ¿©ºÎ¸¦ ¹¯´Â ÇÔ¼ö
			
			nextElement()/nextToken()
			==> µ¥ÀÌÅÍ¸¦ ²¨³¾¶§ »ç¿ëÇÏ´Â ÇÔ¼ö
		
 */
	public Ex01() {
		// ¹®ÀÚ¿­ ÁØºñ
		String str = "°¡³ª´Ù¶ó/¸¶¹Ù/»ç¾ÆÀÚÂ÷";
		// ¹®ÀÚ¿­À» , ¸¦ ±âÁØÀ¸·Î ÀÚ¸¥´Ù.
		StringTokenizer token = new StringTokenizer(str, "/¸¶¹Ù/");
		
		String[] arr = new String[token.countTokens()];
		int idx = 0;
		while(token.hasMoreTokens()) {
			arr[idx++] = token.nextToken();
		}
		System.out.println(Arrays.toString(arr));
	}

	public static void main(String[] args) {
		new Ex01();
	}

}
