package day16;

import java.util.regex.*;
import java.util.*;
public class Test05 {
/*
	Á¤±Ô½Ä °Ë»ç
		==> ÁÖ¾îÁø ¹®ÀÚ¿­ÀÌ Æ¯Á¤ ±ÔÄ¢¿¡ ¸Â°Ô ¸¸µé¾îÁ³´ÂÁö È®ÀÎÇÏ´Â °Ë»ç
			
			¿¹]
				ÁÖ¹Î¹øÈ£°¡ 6-7 ·Î ±¸¼ºµÇ¾î ÀÖ´Â°¡?
				¾ÆÀÌµğ°¡ ¿µ¹®ÀÚ + ¼ıÀÚ + _ ·Î ±¸¼ºµÇ¾î ÀÖ´Â°¡??
				¾ÆÀÌµğ°¡ ÃÖ¼Ò **±ÛÀÚ ·Î µÇ¾îÀÖ´Â°¡??
				
		»ç¿ëÇÏ´Â Å¬·¡½º
			java.util.regex.Pattern
			==> Á¤±Ô½Ä °Ë»ç¿¡ »ç¿ëÇÒ ÆĞÅÏÀ» ¸¸µå´Â Å¬·¡½º
			
			java.util.regex.Matcher
			==> Á¤±Ô½Ç °Ë»ç¸¦ ½ÇÁ¦·Î ½ÇÇàÇÒ Å¬·¡½º
			
		
		°Ë»ç¹æ¹ı]
			1. ÆĞÅÏÀ» ¸¸µé°í
			2. ¹®ÀÚ¿­À» °Ë»çÇÑ´Ù.
			
			
		Á¤±Ô½Ä ¹®¹ı]
			==> ÆĞÅÏ ¸¸µé¶§ »ç¿ëÇÏ´Â ¹®¹ı
			
			1. c[a-z]*
				==> ±ÛÀÚ¸¦ ±â¼úÇÏ¸é ¹İµå½Ã ±× À§Ä¡¿¡ ±× ±ÛÀÚ°¡ ¿Í¾ß ÇÑ´Ù.
					[] ¾È¿¡ ±â·ÏÇÏ¸é ±×Áß¿¡ ÇÏ³ª°¡ ¿Í¾ßÇÑ´Ù´Â ÀÇ¹Ì
					* °¹¼ö¸¦ ÀÌ¾ß±âÇÏ´Âµ¥ 0°³ ÀÌ»óÀ» ÀÇ¹ÌÇÑ´Ù.
				==> Ã¹±ÛÀÚ´Â c ·Î½ÃÀÛÇÏ°í µÎ¹øÂ° ºÎÅÍ´Â ¼Ò¹®ÀÚ°¡ 0°³ÀÌ»ó ¿Íµµ µÈ´Ù.
			
			2. c[a-z]
				==> Ã¹±ÛÀÚ´Â c·Î ½ÃÀÛÇÏ°í ´ÙÀ½±ÛÀÚ´Â ¼Ò¹®ÀÚÁß ÇÏ³ª
				
			3. c[a-zA-Z]
				==> c ·Î ½ÃÀÛÇÏ°í ÀÌÈÄ´Â ¾ËÆÄºª ÇÏ³ª°¡ ¿Í¾ß ÇÑ´Ù.
			
			4. c[a-zA-Z0-9]
				==> c·Î ½ÃÀÛÇÏ°í ´ÙÀ½±ÛÀÚ´Â ¾ËÆÄºªÀÌ³ª ¼ıÀÚ°¡ ¿Í¾ßÇÑ´Ù.
					==> c\w ·Î ÁÙ¿©¼­ »ç¿ëµµ ÇÑ´Ù.
					
			5. .*
				==> . Àº ¸ğµç ¹®ÀÚ¸¦ (¾ËÆÄºª ±×¸®°í ÇÑ±Û±îÁö Æ÷ÇÔ)¸¦ ÀÇ¹ÌÇÑ´Ù.
				==> ¾î¶² ±ÛÀÚ°¡ ¿Íµµ »ó°ü¾ø´Ù.
				
			6. c.
				==> c ·Î ½ÃÀÛÇÏ°í µÚ¿¡´Â ÇÑ±ÛÀÚÀÇ ¹®ÀÚ°¡ ¾Æ¹«°Å³ª ¿Íµµ »ó°ü¾ø´Ù.
			
			7. c.*
				==> c ·Î ½ÃÀÛÇÏ°í µÚ¿¡´Â ¾î¶² ±ÛÀÚ°¡ ¸î°³µç »ó°ü¾ø´Ù.
				
			8. c\.
				==> c ·Î ½ÃÀÛÇÏ°í ´ÙÀ½¿£ . ÀÌ ¿Í¾ß ÇÑ´Ù.
				
			9. c\d
				==> \d == [0-9]
				==> Ã¹±ÛÀÚ´Â c°¡ ¿À°í µÎ¹øÂ°´Â ¼ıÀÚ ÇÏ³ª°¡ ¿Í¾ßÇÑ´Ù.
				
			10. c.*t
				==> c ·Î ½ÃÀÛÇÏ°í ±× ÀÌÈÄ´Â ¹®ÀÚ°¡ 0°³ÀÌ»ó ¿Íµµ µÇ°í ±×¸®°í t ·Î ³¡³ª¾ß ÇÑ´Ù.
				
			11. [b|c].*
				==> b ¶Ç´Â c °¡ ¿Í¾ßÇÏ°í ÀÌÈÄ¿¡´Â ¹®ÀÚ°¡ 0°³ÀÌ»ó ¿Í¾ßÇÑ´Ù.
				
			12. [^b|c]
				==> ^ ´Â NOT ÀÇ ÀÇ¹Ì
				
				[^(b|c)]
			
			13. .*a.*
				==> a°¡ Æ÷ÇÔµÇ¸é µÈ´Ù.
				
			14. .*a.+
				==> * : 0 °³ ÀÌ»ó
					+ : 1 °³ ÀÌ»ó
			
			15. [b|c].{2}
				==> {} ¾ÈÀÇ ¼ıÀÚ´Â ±ÛÀÚ ¼ö¸¦ ÀÇ¹Ì
				
			16. .{2,3}
				==> {} ÀÇ ¼ıÀÚ´Â ±ÛÀÚ ¼ö¸¦ ÀÇ¹ÌÇÏ´Âµ¥ , ´Â OR(|) ¸¦ ÀÇ¹Ì
				
			17. ^, $
				==> ^ - ½ÃÀÛ Ç¥½Ã
					$ - ³¡À» ¾Ë·ÁÁÖ´Â ¹®ÀÚ
					"rsd" <== rsdabcd, arsdabcd, abcdrsd
				
			
			¿¹]
				0[0-9]{2}-[0-9]{3,4}-[0-9]{4}	==> ÀüÈ­¹øÈ£
				0[0-9][0-9]-[0-9]{3,4}-[0-9]{4}
				==> ???	
					0\d{2}-\d{3,4}-\d{4}
		
			
		¹®Á¦ 1]
			¾ÆÀÌµğ¸¦ ÀÔ·ÂÇØ¼­ ÀÔ·Â¹ŞÀº ¾ÆÀÌµğ°¡ ÁöÁ¤Çü½Ä¿¡ ¸Â´ÂÁö °Ë»çÇÏ´Â ÇÁ·Î±×·¥À» ÀÛ¼ºÇÏ¼¼¿ä.
			´Ü,
			¾ÆÀÌµğÀÇ Ã¹±ÛÀÚ´Â ¹İµå½Ã ¿µ¹®ÀÚ·Î ½ÃÀÛ
			µÎ¹øÂ°±ÛÀÚºÎÅÍ´Â ¿µ¹®ÀÚ ¼ıÀÚ ¸¦ »ç¿ëÇÒ ¼öÀÖ°í
			±ÛÀÚ¼ö´Â 8ÀÚ ÀÌ»óÀÌ µÇ¾î¾ß ÇÑ´Ù.
			
		
		¹®Á¦ 2]
			¹®Á¦1] ÇØ°áµÈ »ç¶÷Àº
			Score Å¬·¡½ºÀÇ ÇÑ»ç¶÷ÀÇ µ¥ÀÌÅÍ¸¦ ÀÔ·ÂÇÏ´Âµ¥
			ÀÔ·Â¹ŞÀ» ¶§ Á¤±Ô½Ä °Ë»ç¸¦ ÇØ¼­
			¹Ù¸¥°æ¿ì¸¸ ÀÔ·ÂÇÏ¼¼¿ä...
			
			
		
 */
	Scanner sc ;
	String name;
	public Test05() {
		sc = new Scanner(System.in);
		while(true){
			System.out.println("ÀÌ¸§À» ÀÔ·ÂÇÏ¼¼¿ä!");
			name = sc.nextLine();
			if(getTest(name)) {
				System.out.println("Name : " + name);
				System.out.println(toString());
				System.out.println(this);
				break;
			}
		}
	}
	// [a-zA-Z0-9]	==> \\w - ÇÑ±ÛÁ¦¿Ü
	// [0-9]		==> \\d
	public void getTest01() {
		String phone = "010-7777-7777";
		/*
		 *  1. ¸ÕÀú ÆĞÅÏÀ» ¸¸µç´Ù.
		 *  	¹æ¹ı]
		 				 Pattern Å¬·¡½º¸¦ ÀÌ¿ëÇØ¼­ 
		 				 °Ë»çÇÏ°í ½ÍÀº Á¤±Ô½Ä ¹®¹ıÀ» ¸¸µç´Ù.
		 				 
		 				 Å¬·¡½º´Â »ı¼ºÀÚ ÇÔ¼ö¸¦ È£ÃâÇØ¾ß new ½ÃÅ³ ¼ö ÀÖ´Ù.
		 				 
		 				 ±×·±µ¥ Pattern Å¬·¡½º´Â »ı¼ºÀÚ ÇÔ¼ö°¡ ¾ø´Ù.
		 				 
		 				 ÀÌ·±°æ¿ì´Â ¼Ò¼ÓÇÔ¼öÁß 
		 				 	¼Ó¼ºÀÌ static ÀÌ¸é¼­
		 				 	¹İÈ¯°ªÀÌ ÀÚ±âÀÚ½ÅÀÎ(Pattern)
		 				 ÇÔ¼ö¸¦ Ã£¾Æ¼­ È£ÃâÇÏ°í °á°ú¸¦ ¹İÈ¯ ¹ŞÀ¸¸é
		 				 °´Ã¼¸¦ ¾òÀ» ¼ö ÀÖ´Ù. 
		 				 
		 				 Pattern Å¬·¡½ºÀÇ °æ¿ì compile() ÇÔ¼ö°¡ ±×·± ±â´ÉÀ» °¡Áö°í ÀÖ´Ù.
		 */
		Pattern soo = Pattern.compile("0[0-9]{2}-[0-9]{3,4}-[0-9]{4}");
		Pattern soo1 = Pattern.compile("0\\d{2}-\\d{3,4}-\\d{4}");
		
		/*
				2. ÇØ´ç ÆĞÅÏ¿¡ ¸Â´ÂÁö °Ë»çÇÑ´Ù.
					¹®¹ı °Ë»ç¸¦ ÇÏ´Â ÇÔ¼ö°¡ matcher()
					ÀÌ ÇÔ¼ö´Â °Ë»ç °á°ú¸¦ Matcher °´Ã¼·Î ¹İÈ¯ ÇØÁØ´Ù.
		 */
		
		Matcher mat = soo1.matcher(phone);
		/*
		 		3. Matcher °´Ã¼¿¡ ´ã°ÜÀÖ´Â °Ë»ç°á°ú Á¤º¸¸¦ »Ì¾Æ³½´Ù.
		 			±× ¿ªÇÒÀ» ÇÏ´Â ÇÔ¼ö°¡
		 				matches() 
		 			ÀÌ´Ù.
		 			
		 			°Ë»ç °á°ú¸¦ ³í¸®ÇüÀ¸·Î ¹İÈ¯ÇØÁÖ´Â ÇÔ¼öÀÌ´Ù.
		 */
		
		boolean bool = mat.matches();
		
		if(bool) {
			System.out.println("*** ¿Ã¹Ù¸¥ ÀüÈ­¹øÈ£ ÀÔ´Ï´Ù. ***");
		} else {
			System.out.println("### ÀüÈ­¹øÈ£ Çü½ÄÀÌ Àß¸øµÇ¾ú½À´Ï´Ù. ###");
		}
		
		Pattern p1 = Pattern.compile("\\w{0,10}");
		Scanner sc = new Scanner(System.in);
		Matcher m1 ;
		while(true) {
			System.out.println("ÀÌ¸§À» ÀÔ·ÂÇÏ¼¼¿ä! : ");
			String name = sc.nextLine();
			m1 = p1.matcher(name);
			if(name.equals("quit")) break;
			
			if(m1.matches()) {
				System.out.println("OK!!!");
				break;
			} else {
				System.out.println("NO !!!!!");
				
			}
			
		}
	}
	
	// ÀÌ¸§ Á¤±Ô½Ä °Ë»ç ÇÔ¼ö
	public boolean getTest(String str) {
		return Pattern.compile("^[°¡-ÆR]{2,10}$").matcher(str).matches();
/*		
		Pattern pat = Pattern.compile("^[°¡-ÆR]{2,10}$");
		Matcher mat = pat.matcher(str);
		return mat.matches();
*/
	}
	
	public String toString() {
		return "Name : " + name ;
	}
	
	public static void main(String[] args) {
		new Test05();
	}

}
