package day08;

/*
		문제 1]
				반지름 하나를 랜덤하게 입력한 후
				원의 넓이와 둘레를 계산하여 출력하는 프로그램을 작성하세요
				단, 입력, 넓이계산, 둘레계산, 출력은 함수로 처리하세요.
				
		문제 2]
				1차 배열에 10개의 데이터를 입력한 후
				총점과 평균을 구하는 프로그램을 작성하세요.
				단, 입력, 총점계산, 평균계산, 출력은 함수로 처리하세요.
				
		문제 3]
				10 학생의 국어, 영어, 수학 점수를 입력받아
				총점과 평균을 구하는 프로그램을 작성하세요.
				단, 입력, 총점계산, 석차, 출력은 함수로 처리하세요.
				그리고 배열은 [10][5] 로 만든다.
				즉, 총점과 석차도 같은 배열에 입력하도록 하세요...
				
		Bonus]
				두개의 숫자를 입력해서
				다섯가지 연산의 결과를 반환해주는 함수를 만들고 실행해서
				결과를 출력하세요.
				함수는 하나로 처리하세요.
				
		
 */

public class HW01 {

	public static void main(String[] args) {

	}

}
