package day02;

/**
 * 
 * @author 	전은석
 * @since 	2019-03-20
 * 
 * 			두째날 수업 설명
 *
 */


public class Test01 {
/*
 * 	클래스 만드는 규칙
 * 
 *  	[public] class 클래스이름 {
 *  		클래스내용...
 *  	}
 *  
 *  	클래스이름 만드는 규칙
 *  		- 첫글자는 알파벳 대문자로 한다. (암묵적인 룰...)
 *  		- 자바에서 이름을 만들때 사용할 수 있는 문자는 _, $, 영소|대문자
 *  		- 만약 두단어를 붙여서 이름을 만들경우는 자바는 카멜표기법을 따른다.
 *  			- 표기법 종류
 *  				a. SNAKE 표기법 - 	두단어사이에 _ 로 연결해서 만드는 표기법 
 *  					예]
 *  						CLASS 와 ONE을 사용해서 만드는 경우 
 *  							Class_one 
 *  
 *  				b. CAMEL 표기법	- 	이어지는 단어의 첫글자를 대문자로 하고 
 *  									나머지 문자는 소문자로 이어서 만드는 표기법
 *  					예]
 *  						CLASS 와 ONE을 사용해서 만드는 경우 
 *  							ClassOne
 *  
 *  ### 클래스이름은 파일이름과 동일하게 작성해야 한다. ###
 *  
 *  	이름을 만들때 사용할 수 없는 단어들이 있는데...
 *  	예약어는 사용 못한다. 
 *  		예]
 *  			class
 *  
 */
	
	
/*
 * 	사용되는 기호
 *   	1. {} - 블럭(범위)의 표시
 *   	2. ;  - 하나의 명령이 끝났다는 표시
 */
	
	// main 함수 아래 형식을 반드시 지켜줘야 한다.
	// main 함수 : 실제 프로그램을 실행 시켜주는 함수....
	// 클래스는 메인함수가 없어도 만들수 있다.
	// 실행은 반드시 메인함수에서 해줘야만 한다.
	public static void main(String[] args) {
		System.out.println("*** 영수 만세!!!! ***");
		/*
		 * println() - 콘솔에 문자열을 출력하고 줄바꿈 해주는 함수
		 * 				pl/sql의 put_line() 과 같은 기능
		 * 
		 * print()	- 콘솔에 문자열을 출력하는데 줄바꿈 하지 않는다.
		 * 
		 * printf() - 출력형식을 지정해서 출력해주는 함수
		 * 
		 */
	}

}
